# -*- coding:utf-8 -*-
"""
题目：从1-n整数中1出现的次数
从1 到 n 中1出现的次数

思路：
1、i分别取个位、十位、百位等，分别对每个数位上有多少包含1的点进行分析
2、根据i对n进行分割，其中高位：a = n/i ，低位b=n%i
共有以下三种情况：
(1) 当百位对应的数>=2 or =0时，例如n = 31456, i = 100
    a=314，b=56, 则百位为1时共有(314/10 + 1) = (314+8)/10 = 32。个位、十位的范围是0—99=100，所以共有(a+8)/10*i种情况
(2) 当百位对应的数=1时，例如n = 31156, i = 100
    a=311, b=56, 则百位为1时共有(311 % 10)种情况，个位、十位的范围是0-56=b+1,所以共有(a%10 == 1)*(b+1)种情况
(3) 当百位对应的数为0时，例如n = 31056, i = 100
    a=310, b=56, 则百位为1时共有(310 / 10) = 31种情况, 个位、十位的范围是0—99=100，所以共有(a+8)/10*i种情况
"""
class Solution:
    def NumberOf1Between1AndN_Solution(self, n):
        res = 0
        i = 1
        while i <= n:
            a = n/i
            b = n%i
            res += (a+8)/10*i + (a%10 == 1)*(b+1)
            i *= 10
        return res
